ghi-electronics/TinyCLR-Ports/Targets/LPC177x_LPC178x/LPC17_USART.cpp
    /****/ volatile uint32_t UART_SCR;                                   //Scratch pad register.

    /****/ volatile uint32_t UART_ACR;                                   //Autobaud control register.
    static const uint32_t UART_ACR_START = 0x00000001;     // Start bit
    static const uint32_t UART_ACR_MODE1 = 0x00000002;     // Mode 1
    static const uint32_t UART_ACR_AUTO_RESTART = 0x00000004;     // Auto Restart
    static const uint32_t UART_ACR_AUTOBAUD_INT_CLR = 0x00000100;     // Autobaud interrupt clear
    static const uint32_t UART_ACR_TIMEOUT_INT_CLR = 0x00000200;     // Autobaud timeout interrupt clear

    /****/ volatile uint32_t UART_ICR;                                   //IrDA control register.

    /****/ volatile uint32_t UART_FDR;                                   //Fractional divider register.
    static const uint32_t UART_FDR_DIVADDVAL_mask = 0x0000000F;
    static const uint32_t UART_FDR_DIVADDVAL_shift = 0x00000000;
    static const uint32_t UART_FDR_MULVAL_mask = 0x000000F0;
    static const uint32_t UART_FDR_MULVAL_shift = 0x00000004;

    /****/ volatile uint32_t PADDING_3;

    /****/ volatile uint32_t UART_TER;                                   //Transmit Enable register.
    static const uint32_t UART_TER_TXEN = 0x00000080;  //TX Enable bit

    static LPC17xx_USART  & UART(int sel) {


        if (sel == LPC17xx_USART::c_Uart_0) {

            return *(LPC17xx_USART  *)(size_t)LPC17xx_USART::c_UartBase_0;

        }
        else if (sel == LPC17xx_USART::c_Uart_1) {

            return *(LPC17xx_USART  *)(size_t)LPC17xx_USART::c_UartBase_1;

        }
        else if (sel == LPC17xx_USART::c_Uart_2) {

            return *(LPC17xx_USART  *)(size_t)LPC17xx_USART::c_UartBase_2;

        }
        else if (sel == LPC17xx_USART::c_Uart_3) {

            return *(LPC17xx_USART  *)(size_t)LPC17xx_USART::c_UartBase_3;

        }
        else {

            return *(LPC17xx_USART  *)(size_t)LPC17xx_USART::c_UartBase_4;

        }
    }
};

#define USART_EVENT_POST_DEBOUNCE_TICKS (10 * 10000) // 10ms between each events

void LPC17_Uart_EventCallback(const TinyCLR_Task_Manager* self, const TinyCLR_Api_Manager* apiManager, TinyCLR_Task_Reference task, void* arg);

static const uint32_t uartTxDefaultBuffersSize[] = LPC17_UART_DEFAULT_TX_BUFFER_SIZE;
static const uint32_t uartRxDefaultBuffersSize[] = LPC17_UART_DEFAULT_RX_BUFFER_SIZE;

struct UartState {
    int32_t controllerIndex;

    uint8_t                             *txBuffer;
    uint8_t                             *rxBuffer;

    size_t                              txBufferCount;
    size_t                              txBufferIn;
    size_t                              txBufferOut;
    size_t                              txBufferSize;

    size_t                              rxBufferCount;
    size_t                              rxBufferIn;
    size_t                              rxBufferOut;
    size_t                              rxBufferSize;

    bool                                handshaking;
    bool                                enable;

    TinyCLR_Uart_ErrorReceivedHandler   errorEventHandler;
    TinyCLR_Uart_DataReceivedHandler    dataReceivedEventHandler;
    TinyCLR_Uart_ClearToSendChangedHandler cleartosendEventHandler;

    TinyCLR_Task_Reference dataReceivedCallbackTaskReference;
    bool wasDataReceivedCallbackTaskEnqueued;

    TinyCLR_Task_Reference errorCallbackTaskReference;
    bool wasErrorCallbackTaskEnqueued;

    const TinyCLR_Task_Manager* taskManager;

    const TinyCLR_Uart_Controller* controller;

    bool tableInitialized;

    uint16_t initializeCount;

    uint64_t lastEventTime;
    size_t lastReadRxBufferCount;

    uint8_t error;
};

#define SET_BITS(Var,Shift,Mask,fieldsMask) {Var = setFieldValue(Var,Shift,Mask,fieldsMask);}

uint32_t setFieldValue(volatile uint32_t oldVal, uint32_t shift, uint32_t mask, uint32_t val) {
    volatile uint32_t temp = oldVal;

    temp &= ~mask;
    temp |= val << shift;
    return temp;
}

static UartState uartStates[TOTAL_UART_CONTROLLERS];
static TinyCLR_Uart_Controller uartControllers[TOTAL_UART_CONTROLLERS];
static TinyCLR_Api_Info uartApi[TOTAL_UART_CONTROLLERS];

const char* uartApiNames[] = {
#if TOTAL_UART_CONTROLLERS > 0
"GHIElectronics.TinyCLR.NativeApis.LPC17.UartController\\0",
#if TOTAL_UART_CONTROLLERS > 1
"GHIElectronics.TinyCLR.NativeApis.LPC17.UartController\\1",
#if TOTAL_UART_CONTROLLERS > 2
"GHIElectronics.TinyCLR.NativeApis.LPC17.UartController\\2",
#if TOTAL_UART_CONTROLLERS > 3
"GHIElectronics.TinyCLR.NativeApis.LPC17.UartController\\3",
#if TOTAL_UART_CONTROLLERS > 4
"GHIElectronics.TinyCLR.NativeApis.LPC17.UartController\\4",
#endif
#endif
#endif
#endif
#endif
};

void LPC17_Uart_EnsureTableInitialized() {
    for (int32_t i = 0; i < TOTAL_UART_CONTROLLERS; i++) {
        if (uartStates[i].tableInitialized)
            continue;

        uartControllers[i].ApiInfo = &uartApi[i];
        uartControllers[i].Acquire = &LPC17_Uart_Acquire;
        uartControllers[i].Release = &LPC17_Uart_Release;
        uartControllers[i].Enable = &LPC17_Uart_Enable;
        uartControllers[i].Disable = &LPC17_Uart_Disable;
        uartControllers[i].SetActiveSettings = &LPC17_Uart_SetActiveSettings;
        uartControllers[i].Flush = &LPC17_Uart_Flush;
        uartControllers[i].Read = &LPC17_Uart_Read;
        uartControllers[i].Write = &LPC17_Uart_Write;
        uartControllers[i].SetErrorReceivedHandler = &LPC17_Uart_SetErrorReceivedHandler;
        uartControllers[i].SetDataReceivedHandler = &LPC17_Uart_SetDataReceivedHandler;
        uartControllers[i].GetClearToSendState = &LPC17_Uart_GetClearToSendState;
        uartControllers[i].SetClearToSendChangedHandler = &LPC17_Uart_SetClearToSendChangedHandler;
        uartControllers[i].GetIsRequestToSendEnabled = &LPC17_Uart_GetIsRequestToSendEnabled;
        uartControllers[i].SetIsRequestToSendEnabled = &LPC17_Uart_SetIsRequestToSendEnabled;
        uartControllers[i].GetReadBufferSize = &LPC17_Uart_GetReadBufferSize;
        uartControllers[i].SetReadBufferSize = &LPC17_Uart_SetReadBufferSize;
        uartControllers[i].GetWriteBufferSize = &LPC17_Uart_GetWriteBufferSize;
        uartControllers[i].SetWriteBufferSize = &LPC17_Uart_SetWriteBufferSize;
        uartControllers[i].GetBytesToRead = &LPC17_Uart_GetBytesToRead;
        uartControllers[i].GetBytesToWrite = &LPC17_Uart_GetBytesToWrite;
        uartControllers[i].ClearReadBuffer = &LPC17_Uart_ClearReadBuffer;
        uartControllers[i].ClearWriteBuffer = &LPC17_Uart_ClearWriteBuffer;

