ghi-electronics/TinyCLR-Ports/Targets/LPC177x_LPC178x/LPC17_USART.cpp
    return TinyCLR_Result::Success;
}

void LPC17_Uart_ReceiveData(int controllerIndex, uint32_t LSR_Value, uint32_t IIR_Value) {
    INTERRUPT_STARTED_SCOPED(isr);

    DISABLE_INTERRUPTS_SCOPED(irq);

    LPC17xx_USART& USARTC = LPC17xx_USART::UART(controllerIndex);

    auto state = &uartStates[controllerIndex];
    bool error = (LSR_Value & (LPC17xx_USART::UART_LSR_PEI | LPC17xx_USART::UART_LSR_OEI | LPC17xx_USART::UART_LSR_FEI)) != 0;

    // Read data from Rx FIFO
    if ((USARTC.SEL2.IER.UART_IER & (LPC17xx_USART::UART_IER_RDAIE)) || error) {
        if ((LSR_Value & LPC17xx_USART::UART_LSR_RFDR) || (IIR_Value == LPC17xx_USART::UART_IIR_IID_Irpt_RDA) || (IIR_Value == LPC17xx_USART::UART_IIR_IID_Irpt_TOUT) || (error)) {
            do {
                // Still read latest data
                auto data = (uint8_t)USARTC.SEL1.RBR.UART_RBR;

                auto raiseDataReceived = false;
                auto raiseErrorReceived = false;

                if ((LSR_Value & LPC17xx_USART::UART_LSR_RFDR) || (IIR_Value == LPC17xx_USART::UART_IIR_IID_Irpt_RDA) || (IIR_Value == LPC17xx_USART::UART_IIR_IID_Irpt_TOUT))
                {
                    state->rxBuffer[state->rxBufferIn++] = data;

                    if (state->rxBufferCount < state->rxBufferSize) {
                        state->rxBufferCount++;
                    }

                    if (state->rxBufferIn == state->rxBufferSize)
                        state->rxBufferIn = 0;

                    raiseDataReceived = true;
                }

                if (state->rxBufferCount == state->rxBufferSize) {
                    state->error = 1 << (uint8_t)TinyCLR_Uart_Error::BufferFull;
                    raiseErrorReceived = true;
                }
                else if (LSR_Value & 0x02) {
                    state->error = 1 << (uint8_t)TinyCLR_Uart_Error::Overrun;
                    raiseErrorReceived = true;
                }
                else if ((LSR_Value & 0x08) || (LSR_Value & 0x80)) {
                    state->error = 1 << (uint8_t)TinyCLR_Uart_Error::Frame;
                    raiseErrorReceived = true;
                }
                else if (LSR_Value & 0x04) {
                    state->error = 1 << (uint8_t)TinyCLR_Uart_Error::ReceiveParity;
                    raiseErrorReceived = true;
                }

                // If Data Rx and Error happen at same time, Error event has higher priority.
                // Raise the error first so user know dataEvent comes after may wrong.
                if (raiseErrorReceived)
                    LPC17_Uart_EventCallback(state->taskManager, apiManager, state->errorCallbackTaskReference, (void*)state);
                else if (raiseDataReceived)
                    // Task callback will decide post the event immediately or delay
                    LPC17_Uart_EventCallback(state->taskManager, apiManager, state->dataReceivedCallbackTaskReference, (void*)state);

                // Update next loop
                LSR_Value = USARTC.UART_LSR;
                error = (LSR_Value & (LPC17xx_USART::UART_LSR_PEI | LPC17xx_USART::UART_LSR_OEI | LPC17xx_USART::UART_LSR_FEI));

            } while ((LSR_Value & LPC17xx_USART::UART_LSR_RFDR) || error);
        }
    }
}
void LPC17_Uart_TransmitData(int controllerIndex, uint32_t LSR_Value, uint32_t IIR_Value) {
    INTERRUPT_STARTED_SCOPED(isr);

    DISABLE_INTERRUPTS_SCOPED(irq);

    LPC17xx_USART& USARTC = LPC17xx_USART::UART(controllerIndex);

    auto state = &uartStates[controllerIndex];

    // Send data
    if ((LSR_Value & LPC17xx_USART::UART_LSR_TE) || (IIR_Value == LPC17xx_USART::UART_IIR_IID_Irpt_THRE)) {
        // Check if CTS is high
        if (LPC17_Uart_CanSend(controllerIndex)) {
            if (state->txBufferCount > 0) {
                uint8_t txdata = state->txBuffer[state->txBufferOut++];

                state->txBufferCount--;

                if (state->txBufferOut == state->txBufferSize)
                    state->txBufferOut = 0;

                USARTC.SEL1.THR.UART_THR = txdata; // write TX data

            }
            else {
                LPC17_Uart_TxBufferEmptyInterruptEnable(controllerIndex, false); // Disable interrupt when no more data to send.
            }
        }
        else {
            // Temporary disable tx during cts is high to avoild device lockup
            LPC17_Uart_TxBufferEmptyInterruptEnable(controllerIndex, false);
        }
    }
}

void LPC17_UART_IntHandler(int controllerIndex) {
    INTERRUPT_STARTED_SCOPED(isr);

    DISABLE_INTERRUPTS_SCOPED(irq);

    LPC17xx_USART& USARTC = LPC17xx_USART::UART(controllerIndex);

    volatile uint32_t LSR_Value = USARTC.UART_LSR;           // Store LSR value since it's Read-to-Clear
    volatile uint32_t IIR_Value = USARTC.SEL3.IIR.UART_IIR & LPC17xx_USART::UART_IIR_IID_mask;

    auto state = &uartStates[controllerIndex];

    LPC17_Uart_ReceiveData(controllerIndex, LSR_Value, IIR_Value);

    LPC17_Uart_TransmitData(controllerIndex, LSR_Value, IIR_Value);

    if (state->handshaking) {
        volatile uint32_t msr = USARTC.UART_MSR; // clear cts interrupt

        if (msr & 0x1) {  // detect cts changed bit
            bool ctsState = true;

            LPC17_Uart_GetClearToSendState(state->controller, ctsState);

            if (state->cleartosendEventHandler != nullptr)
                state->cleartosendEventHandler(state->controller, ctsState, LPC17_Time_GetSystemTime(nullptr));

            // If tx was disable to avoid locked up
            // Need Enable back if detected OK to send
            if (ctsState)
                LPC17_Uart_TxBufferEmptyInterruptEnable(controllerIndex, true);
        }
    }
}
//--//
void LPC17_UART0_IntHandler(void *param) {
    LPC17_UART_IntHandler(0);
}

void LPC17_UART1_IntHandler(void *param) {
    LPC17_UART_IntHandler(1);
}

void LPC17_UART2_IntHandler(void *param) {
    LPC17_UART_IntHandler(2);
}

void LPC17_UART3_IntHandler(void *param) {
    LPC17_UART_IntHandler(3);
}
void LPC17_UART4_IntHandler(void *param) {
    LPC17_UART_IntHandler(4);
}

TinyCLR_Result LPC17_Uart_Acquire(const TinyCLR_Uart_Controller* self) {
    auto state = reinterpret_cast<UartState*>(self->ApiInfo->State);

    if (state->initializeCount == 0) {
        auto controllerIndex = state->controllerIndex;

        if (controllerIndex >= TOTAL_UART_CONTROLLERS)
            return TinyCLR_Result::ArgumentInvalid;

