ghi-electronics/TinyCLR-Ports/Targets/LPC177x_LPC178x/LPC17_USART.cpp
    return TinyCLR_Result::Success;
}

TinyCLR_Uart_Error LPC17_Uart_GetError(uint32_t error) {
    switch (error) {
    case 1:
        return TinyCLR_Uart_Error::Frame;

    case 2:
        return TinyCLR_Uart_Error::Overrun;

    case 8:
        return TinyCLR_Uart_Error::ReceiveParity;

    default:
        return TinyCLR_Uart_Error::BufferFull;
    }
}

void LPC17_Uart_EventCallback(const TinyCLR_Task_Manager* self, const TinyCLR_Api_Manager* apiManager, TinyCLR_Task_Reference task, void* arg) {
    auto state = reinterpret_cast<UartState*>(arg);

    if (task == state->dataReceivedCallbackTaskReference) {
        if (state->rxBufferCount > 0 && state->dataReceivedEventHandler != nullptr) {
            auto canPostEvent = LPC17_Uart_CanPostEvent(state->controllerIndex);

            // First byte or canPost, post immediately asap
            if ((state->rxBufferCount == 1 && state->lastReadRxBufferCount == 0) || canPostEvent) {
                state->dataReceivedEventHandler(state->controller, state->rxBufferCount - state->lastReadRxBufferCount, LPC17_Time_GetSystemTime(nullptr));

                // Clear for next Enqueue
                state->wasDataReceivedCallbackTaskEnqueued = false;
            }
            else {
                // Couldn't post event on time, scheduel callback to do later.
                if (state->wasDataReceivedCallbackTaskEnqueued == false) {
                    state->taskManager->Enqueue(state->taskManager, task, LPC17_Time_GetProcessorTicksForTime(nullptr, USART_EVENT_POST_DEBOUNCE_TICKS));
                    state->wasDataReceivedCallbackTaskEnqueued = true;
                }
            }
        }
    }
    else if (task == state->errorCallbackTaskReference) {
        if (state->error > 0 && state->errorEventHandler != nullptr) {
            auto canPostEvent = LPC17_Uart_CanPostEvent(state->controllerIndex);

            //If new error detected or called by callback and can post event, post the event.
            if (canPostEvent) {
                auto error = LPC17_Uart_GetError(state->error);
                state->errorEventHandler(state->controller, error, LPC17_Time_GetSystemTime(nullptr));

                // Clear error
                state->error = 0;

                // Clear for next Enqueue
                state->wasErrorCallbackTaskEnqueued = false;
            }
            else {
                // Couldn't post event on time, scheduel callback to do later.
                if (state->wasErrorCallbackTaskEnqueued == false) {
                    state->taskManager->Enqueue(state->taskManager, task, LPC17_Time_GetProcessorTicksForTime(nullptr, USART_EVENT_POST_DEBOUNCE_TICKS));

                    state->wasErrorCallbackTaskEnqueued = true;
                }
            }
        }
    }
}

TinyCLR_Result LPC17_Uart_SetErrorReceivedHandler(const TinyCLR_Uart_Controller* self, TinyCLR_Uart_ErrorReceivedHandler handler) {
    auto state = reinterpret_cast<UartState*>(self->ApiInfo->State);

    if (handler != nullptr) {
        state->errorEventHandler = handler;
        state->taskManager = (const TinyCLR_Task_Manager*)apiManager->FindDefault(apiManager, TinyCLR_Api_Type::TaskManager);
        state->taskManager->Create(state->taskManager, LPC17_Uart_EventCallback, (void*)state, false, state->errorCallbackTaskReference);
    }
    else {
        if (state->errorEventHandler != nullptr && state->taskManager != nullptr && state->errorCallbackTaskReference) {
            state->taskManager->Free(state->taskManager, state->errorCallbackTaskReference);

            state->errorEventHandler = nullptr;
            state->errorCallbackTaskReference = nullptr;
        }

    }

    return TinyCLR_Result::Success;
}

TinyCLR_Result LPC17_Uart_SetDataReceivedHandler(const TinyCLR_Uart_Controller* self, TinyCLR_Uart_DataReceivedHandler handler) {
    auto state = reinterpret_cast<UartState*>(self->ApiInfo->State);

    if (handler != nullptr) {
        state->dataReceivedEventHandler = handler;
        state->taskManager = (const TinyCLR_Task_Manager*)apiManager->FindDefault(apiManager, TinyCLR_Api_Type::TaskManager);
        state->taskManager->Create(state->taskManager, LPC17_Uart_EventCallback, (void*)state, false, state->dataReceivedCallbackTaskReference);
    }

    else {
        if (state->dataReceivedEventHandler != nullptr && state->taskManager != nullptr && state->dataReceivedCallbackTaskReference != nullptr) {
            state->taskManager->Free(state->taskManager, state->dataReceivedCallbackTaskReference);

            state->dataReceivedEventHandler = nullptr;
            state->dataReceivedCallbackTaskReference = nullptr;
        }

    }

    return TinyCLR_Result::Success;
}

TinyCLR_Result LPC17_Uart_GetClearToSendState(const TinyCLR_Uart_Controller* self, bool& value) {
    auto state = reinterpret_cast<UartState*>(self->ApiInfo->State);

    value = true;

    if (state->handshaking) {
        auto controllerIndex = state->controllerIndex;
        auto ctsPin = LPC17_Uart_GetCtsPin(controllerIndex);

        // Reading the pin state to protect values from register for inteterupt which is higher priority (some bits are clear once read)
        TinyCLR_Gpio_PinValue pinState;
        LPC17_Gpio_Read(nullptr, ctsPin, pinState);

        value = (pinState == TinyCLR_Gpio_PinValue::High) ? false : true;
    }

    return TinyCLR_Result::Success;
}

TinyCLR_Result LPC17_Uart_SetClearToSendChangedHandler(const TinyCLR_Uart_Controller* self, TinyCLR_Uart_ClearToSendChangedHandler handler) {
    auto state = reinterpret_cast<UartState*>(self->ApiInfo->State);
    state->cleartosendEventHandler = handler;

    return TinyCLR_Result::Success;
}

TinyCLR_Result LPC17_Uart_GetIsRequestToSendEnabled(const TinyCLR_Uart_Controller* self, bool& value) {
    auto state = reinterpret_cast<UartState*>(self->ApiInfo->State);

    value = false;

    if (state->handshaking) {
        auto controllerIndex = state->controllerIndex;
        auto rtsPin = LPC17_Uart_GetRtsPin(controllerIndex);

